[
  {
    "Proto-Semitic": {
      "name": "Proto-Semitic",
      "phonetic": "ˈprotə sɪˈmɪtɪk",
      "years": "4000 BCE - 3700 BCE",
      "childToType": {
        "West Semitic": "Replace",
        "East Semitic": "Replace"
      },
      "influences": [],
      "alphabet": "",
      "description": "Proto-Semitic is the hypothetical reconstructed proto-language ancestral to the Semitic languages. There is no consensus regarding the location of the Proto-Semitic Urheimat; scholars hypothesize that it may have originated in the Levant, the Sahara or the Horn of Africa, and the view that it arose in the Arabian Peninsula has also been common historically, nowadays the likeliest place is North Africa.\n\nThe Semitic language family is considered part of the broader macro-family of Afroasiatic languages."
    }
  },
  {
    "West Semitic": {
      "name": "West Semitic",
      "phonetic": "wɛst sɪˈmɪtɪk",
      "years": "3700 BCE - 2700 BCE",
      "childToType": {
        "South Semitic": "Replace",
        "Central Semitic": "Replace",
        "Northwest Semitic": "Replace"
      },
      "influences": [
        "East Semitic"
      ],
      "alphabet": "",
      "description": "The West Semitic languages are a proposed major sub-grouping of ancient Semitic languages. The term was first coined in 1883 by Fritz Hommel.\n\nThe grouping, supported by Semiticists like Robert Hetzron and John Huehnergard, divides the Semitic language family into two branches: Eastern and Western."
    },
    "East Semitic": {
      "name": "East Semitic",
      "phonetic": "iːst sɪˈmɪtɪk",
      "years": "3700 BCE - 2700 BCE",
      "childToType": {
        "Eblaite": "Replace",
        "Akkadian": "Replace"
      },
      "influences": [
        "West Semitic",
        "North Central Semitic"
      ],
      "alphabet": "",
      "description": "The East Semitic languages are one of three divisions of the Semitic languages. The East Semitic group is attested by three distinct languages, Akkadian, Eblaite and possibly Kishite, all of which have been long extinct. They were influenced by the non-Semitic Sumerian language and adopted cuneiform writing."
    }
  },
  {
    "Northwest Semitic": {
      "name": "Northwest Semitic",
      "phonetic": "nɔːθ wɛst sɪˈmɪtɪk",
      "years": "2700 BCE - 2340 BCE",
      "childToType": {
        "Canaanite": "Replace",
        "Amorite": "Replace"
      },
      "influences": [
        "Eblaite",
        "Central Semitic"
      ],
      "alphabet": "",
      "description": "Northwest Semitic is a division of the Semitic languages comprising the indigenous languages of the Levant. It emerged from Proto-Semitic in the Early Bronze Age. It is first attested in proper names identified as Amorite in the Middle Bronze Age. The oldest coherent texts are in Ugaritic, dating to the Late Bronze Age, which by the time of the Bronze Age collapse are joined by Old Aramaic, and by the Iron Age by Sutean and the Canaanite languages."
    },
    "Central Semitic": {
      "name": "Central Semitic",
      "phonetic": "ˈsɛntrəl sɪˈmɪtɪk",
      "years": "2700 BCE - 1080 BCE",
      "childToType": {
        "Old Arabic": "Replace"
      },
      "influences": [
        "South Semitic",
        "Akkadian",
        "Old South Arabian",
        "Eastern South Semitic",
        "Northwest Semitic",
        "Amorite",
        "Sabaean",
        "Canaanite",
        "Proto-Aramaic"
      ],
      "alphabet": "",
      "description": "Central Semitic languages are one of the three groups of West Semitic languages, alongside Modern South Arabian languages and Ethiopian Semitic languages.\n\nCentral Semitic can itself be further divided into two groups: Arabic and Northwest Semitic. Northwest Semitic languages largely fall into either Aramaic or Canaanite languages."
    },
    "South Semitic": {
      "name": "South Semitic",
      "phonetic": "saʊθ sɪˈmɪtɪk",
      "years": "3250 BCE - 1700 BCE",
      "childToType": {
        "Old South Arabian": "Replace",
        "Eastern South Semitic": "Replace",
        "Ethiopic": "Add"
      },
      "influences": [
        "North Central Semitic",
        "Ethiopic",
        "Central Semitic"
      ],
      "alphabet": "",
      "description": "South Semitic is a putative branch of the Semitic languages, which form a branch of the larger Afro-Asiatic language family, found in (North and East) Africa and Western Asia."
    },
    "Akkadian": {
      "name": "Akkadian",
      "phonetic": "əˈkeɪdiən",
      "years": "2700 BCE - 330 BCE",
      "childToType": {},
      "influences": [
        "Eblaite",
        "Central Semitic",
        "Old Arabic",
        "Old Aramaic"
      ],
      "alphabet": "𒀝𒅗𒁺𒌑",
      "description": "Akkadian is an extinct East Semitic language that was spoken in ancient Mesopotamia (Akkad, Assyria, Isin, Larsa and Babylonia) from the third millennium BC until its gradual replacement by Akkadian-influenced Old Aramaic among Mesopotamians by the 8th century BC."
    },
    "Eblaite": {
      "name": "Eblaite",
      "phonetic": "ˈɛblə.aɪt",
      "years": "2700 BCE - 1900 BCE",
      "childToType": {
      },
      "influences": [
        "Akkadian",
        "Northwest Semitic",
        "Amorite"
      ],
      "alphabet": "𒌈𒆷",
      "description": "Eblaite, or Palaeo-Syrian, is an extinct East Semitic language used during the 3rd millennium BC by the populations of Northern Syria. It was named after the ancient city of Ebla, in modern western Syria. Variants of the language were also spoken in Mari and Nagar."
    }
  },
  {
    "Canaanite": {
      "name": "Canaanite",
      "phonetic": "pɹətəʊ kənæænaɪ̯t",
      "years": "2340 BCE - 1080 BCE",
      "childToType": {
        "Moabite": "Replace",
        "Edomite": "Replace",
        "Ammonite": "Replace",
        "Phoenician": "Replace",
        "Biblical Hebrew": "Replace",
        "Old Aramaic": "Replace"
      },
      "influences": [
        "Akkadian",
        "Amorite",
        "Central Semitic"
      ],
      "alphabet": "",
      "description": "The Canaanite languages, or Canaanite dialects, are one of the three subgroups of the Northwest Semitic languages, the others being Aramaic and Ugaritic, all originating in the Levant and Mesopotamia.\n\nProto-Canaanite is a name used for a version of the Proto-Sinaitic script as used in Canaan, an area encompassing modern Lebannon, Israel, Palestine and western parts of Syria. It is also used to refer to an early version of the Phoenican script as used before 1050 BC, or an ancestor of the Phoenician script."
    },
    "Old Arabic": {
      "name": "Old Arabic",
      "phonetic": "əʊld æɹəbɪk",
      "years": "1080 BCE - 450 CE",
      "childToType": {
        "Arabic": "Replace"
      },
      "influences": [
        "Akkadian",
        "Eastern South Semitic",
        "Sabaean",
        "Mehri-Soqotri",
        "Old Aramaic",
        "Minaean",
        "Mehri",
        "Soqotri",
        "Moabite",
        "Edomite",
        "Ammonite",
        "Mishnaic Hebrew"
      ],
      "alphabet": "",
      "description": "Old Arabic is the name for the pre-Islamic Arabic language or dialect continuum. Various forms of Old Arabic are attested in many scripts like Safaitic, Hismaic, Nabatean, and even Greek."
    },
    "Old South Arabian": {
      "name": "Old South Arabian",
      "phonetic": "əʊld saʊθ əˈreɪbɪən",
      "years": "1700 BCE - 1300 BCE",
      "childToType": {
        "Sabaean": "Replace"
      },
      "influences": [
        "Eastern South Semitic",
        "Ethiopic",
        "Central Semitic"
      ],
      "alphabet": "𐩣𐩯𐩬𐩵",
      "description": "Old South Arabian (or Ṣayhadic or Yemenite) is a group of four closely related extinct languages spoken in the far southern portion of the Arabian Peninsula. They were written in the Ancient South Arabian script."
    },
    "Eastern South Semitic": {
      "name": "Eastern South Semitic",
      "phonetic": "ˈiːstən saʊθ sɪˈmɪtɪk",
      "years": "1700 BCE - 540 BCE",
      "childToType": {
        "Shehri": "Replace",
        "Mehri": "Replace",
        "Soqotri": "Replace"
      },
      "influences": [
        "Old South Arabian",
        "Central Semitic",
        "Old Arabic",
        "Sabaean"
      ],
      "alphabet": "",
      "description": "The Modern South Arabian languages, also known as Eastern South Semitic languages, are a group of endangered languages spoken by small populations inhabiting the Arabian Peninsula, in Yemen and Oman, and Socotra Island."
    },
    "Ethiopic": {
      "name": "Ethiopic",
      "phonetic": "eθɪəʊpɪk",
      "years": "2700 BCE - 1300 BCE",
      "childToType": {
        "North Ethiopic": "Replace",
        "South Ethiopic": "Replace"
      },
      "influences": [
        "South Semitic",
        "Old South Arabian"
      ],
      "alphabet": "",
      "description": "Ethiopian Semitic (also Ethio-Semitic, Ethiosemitic, Ethiopic or Abyssinian) is a family of languages spoken in Ethiopia, Eritrea and Sudan. They form the western branch of the South Semitic languages, itself a sub-branch of Semitic, part of the Afroasiatic language family."
    },
    "Amorite": {
      "name": "Amorite",
      "phonetic": "əmɒɹɪt",
      "years": "2340 BCE - 1080 BCE",
      "childToType": {},
      "influences": [
        "Eblaite",
        "Central Semitic",
        "Canaanite"
      ],
      "alphabet": "",
      "description": "Amorite is an extinct early Semitic language, formerly spoken during the Bronze Age by the Amorite tribes prominent in ancient Near Eastern history. It is known from Ugaritic, classed by some as its westernmost dialect, and from non-Akkadian proper names recorded by Akkadian scribes during periods of Amorite rule in Babylonia."
    }
  },
  {
    "Ammonite": {
      "name": "Ammonite",
      "phonetic": "əməʊnaɪ̯t",
      "years": "1080 BCE - 330 BCE",
      "childToType": {},
      "influences": [
        "Old Arabic",
        "Biblical Hebrew"
      ],
      "alphabet": "𐤏𐤌𐤍",
      "description": "Ammonite is the extinct Canaanite language of the Ammonite people mentioned in the Bible, who used to live in modern-day Jordan, and after whom its capital Amman is named. Only fragments of their language survive—chiefly the 9th century BC Amman Citadel Inscription, the 7th–6th century BC Tel Siran bronze bottle, and a few ostraca. As far as can be determined from the small corpus, it was extremely similar to Biblical Hebrew, with some possible Aramaic influence."
    },
    "Biblical Hebrew": {
      "name": "Biblical Hebrew",
      "phonetic": "bɪblɪkl hi:bɹu:",
      "years": "1080 BCE - 135 CE",
      "childToType": {
        "Mishnaic Hebrew": "Replace",
        "Modern Hebrew": "Revive"
      },
      "influences": [
        "Phoenician",
        "Ammonite",
        "Edomite",
        "Moabite",
        "Old Aramaic"
      ],
      "alphabet": "עִבְרִית מִקְרָאִית",
      "description": "Biblical Hebrew, also called Classical Hebrew, is an archaic form of the Hebrew language, a language in the Canaanite branch of Semitic languages spoken by the Israelites in the area known as the Land of Israel, roughly west of the Jordan River and east of the Mediterranean Sea. The term \"Hebrew\" (ivrit) was not used for the language in the Bible, which was referred to as sefat kena'an (i.e. language of Canaan) or Yehudit (i.e. Judaean), but the name was used in Ancient Greek and Mishnaic Hebrew texts."
    },
    "Phoenician": {
      "name": "Phoenician",
      "phonetic": "fəˈniːʃən",
      "years": "1080 BCE - 450 CE",
      "childToType": {},
      "influences": [
        "Biblical Hebrew"
      ],
      "alphabet": "𐤃𐤁𐤓𐤉𐤌 𐤊𐤍𐤏𐤍𐤉𐤌",
      "description": "Phoenician is an extinct Canaanite Semitic language originally spoken in the region surrounding the cities of Tyre and Sidon. Extensive Tyro-Sidonian trade and commercial dominance led to Phoenician becoming a lingua franca of the maritime Mediterranean during the Iron Age. The Phoenician alphabet spread to Greece during this period, where it became the source of all modern European scripts."
    },
    "Arabic": {
      "name": "Arabic",
      "phonetic": "al ʕaraˈbijːa",
      "years": "450 CE - Today",
      "childToType": {
        "Maltese": "Add",
        "Modern Hebrew": "Add"
      },
      "influences": [
        "Sabaean",
        "Soqotri",
        "Mehri",
        "Shehri",
        "Tigrinya",
        "Gurage",
        "Mandaic",
        "Middle Aramaic",
        "Maltese",
        "Neo Aramaic",
        "Modern Hebrew"
      ],
      "alphabet": "عربي",
      "description": "Arabic is a Semitic language spoken primarily across the Arab world. Having emerged in the 1st century, it is named after the Arab people; the term \"Arab\" was initially used to describe those living in the Arabian Peninsula, as perceived by geographers from ancient Greece."
    },
    "Sabaean": {
      "name": "Sabaean",
      "phonetic": "səbeəi:n",
      "years": "1300 BCE - 630 CE",
      "childToType": {
        "Himyaritic": "Add",
        "Hadramatic": "Add",
        "Minaean": "Add",
        "Qatabanic": "Add"
      },
      "influences": [
        "Eastern South Semitic",
        "Central Semitic",
        "Himyaritic",
        "Hadramatic",
        "Minaean",
        "Old Arabic",
        "Qatabanic",
        "Mehri-Soqotri",
        "Mehri",
        "Arabic"
      ],
      "alphabet": "𐩪𐩨𐩱",
      "description": "Sabaean, also known as Sabaic, was an Old South Arabian language spoken between c. 1000 BC and the 6th century AD, by the Sabaeans. It was used as a written language by some other peoples of the ancient civilization of South Arabia, including the Ḥimyarites, Ḥashidites, Ṣirwāḥites, Humlanites, Ghaymānites, and Radmānites."
    },
    "Shehri": {
      "name": "Shehri",
      "phonetic": "ʃhɹɪ",
      "years": "540 BCE - Today",
      "childToType": {},
      "influences": [
        "Mehri",
        "Soqotri",
        "Arabic"
      ],
      "alphabet": "شحرية",
      "description": "Shehri, also known as Jibbali (\"mountain\" language in Omani Arabic), is a Modern South Arabian language. It is spoken by a small native population inhabiting the coastal towns and the mountains and wilderness areas upland from Salalah, located in the Dhofar Governorate in southwestern Oman."
    },
    "Mehri": {
      "name": "Mehri",
      "phonetic": "mhɹɪ",
      "years": "540 BCE - Today",
      "childToType": {},
      "influences": [
        "Sabaean",
        "Old Arabic",
        "Hadramatic",
        "Shehri",
        "Soqotri",
        "Arabic"
      ],
      "alphabet": "مهريّت",
      "description": "Mehri, or Mahri, is the most spoken of the Modern South Arabian languages (MSALs), a subgroup of the Semitic branch of the Afroasiatic family. It is spoken by the Mehri tribes, who inhabit isolated areas of the eastern part of Yemen, western Oman, particularly the Al Mahrah Governorate, with a small number in Saudi Arabia near the Yemeni and Omani borders."
    },
    "Soqotri": {
      "name": "Soqotri",
      "phonetic": "mɛ́taḷ di-saḳɔ́ṭri",
      "years": "540 BCE - Today",
      "childToType": {},
      "influences": [
        "Old Arabic",
        "Mehri",
        "Shehri",
        "Arabic"
      ],
      "alphabet": "ماتڸ دسقطري",
      "description": "Soqotri is a South Semitic language spoken by the Soqotri people on the island of Socotra and the two nearby islands of Abd al Kuri and Samhah, in the Socotra archipelago, in the Guardafui Channel."
    },
    "North Ethiopic": {
      "name": "North Ethiopic",
      "phonetic": "nɔ:θ eθɪəʊpɪk",
      "years": "1300 BCE - 330 BCE",
      "childToType": {
        "Ge'ez": "Replace"
      },
      "influences": [
        "South Ethiopic"
      ],
      "alphabet": "",
      "description": "A subgroup of Afro-Asiatic languages including Ge'ez, Tigrinya and Tigre."
    },
    "South Ethiopic": {
      "name": "South Ethiopic",
      "phonetic": "saʊ̯θ eθɪəʊpɪk",
      "years": "1300 BCE - 330 BCE",
      "childToType": {
        "Amharic": "Replace",
        "Gurage": "Replace",
        "Harari": "Replace"
      },
      "influences": [
        "North Ethiopic"
      ],
      "alphabet": "",
      "description": "A subgroup of Afro-Asiatic languages including Amharic, Harari and Gurage."
    },
    "Moabite": {
      "name": "Moabite",
      "phonetic": "məʊəbɪt",
      "years": "1080 BCE - 540 BCE",
      "childToType": {},
      "influences": [
        "Old Arabic",
        "Biblical Hebrew"
      ],
      "alphabet": "𐤌𐤀𐤁",
      "description": "The Moabite language, also known as the Moabite dialect, is an extinct sub-language or dialect of the Canaanite languages, themselves a branch of Northwest Semitic languages, formerly spoken in the region described in the Bible as Moab (modern day central-western Jordan) in the early 1st millennium BC."
    },
    "Edomite": {
      "name": "Edomite",
      "phonetic": "edɒmɪt",
      "years": "1080 BCE - 540 BCE",
      "childToType": {},
      "influences": [
        "Old Arabic",
        "Biblical Hebrew"
      ],
      "alphabet": "𐤀𐤃𐤌",
      "description": "Edomite was a Northwest Semitic Canaanite language, very similar to Biblical Hebrew, Ammonite, Phoenician and Amorite spoken by the Edomites in southwestern Jordan and parts of Israel in the 2nd and 1st millennium BCE. It is extinct and known only from a very small corpus. It is attested in a scant number of impression seals, ostraca, and a single late 7th or early 6th century BCE letter, discovered in Horvat Uza."
    },
    "Old Aramaic": {
      "name": "Old Aramaic",
      "phonetic": "əʊld æɹəmeɪɪk",
      "years": "1300 BCE - 450 CE",
      "childToType": {
        "Mandaic": "Replace",
        "Middle Aramaic": "Replace"
      },
      "influences": [
        "Akkadian",
        "Central Semitic",
        "Old Arabic",
        "Biblical Hebrew",
        "Phoenician",
        "Moabite",
        "Mishnaic Hebrew"
      ],
      "alphabet": "𐤕𐤉𐤌𐤁𐤕",
      "description": "Old Aramaic refers to the earliest stage of the Aramaic language, known from the Aramaic inscriptions discovered since the 19th century.\n\nEmerging as the language of the city-states of the Arameans in the Levant in the Early Iron Age, Old Aramaic was adopted as a lingua franca, and in this role was inherited for official use by the Achaemenid Empire during classical antiquity."
    }
  },
  {
    "Middle Aramaic": {
      "name": "Middle Aramaic",
      "phonetic": "mɪdl æɹəmeɪɪk",
      "years": "450 CE - 1230 CE",
      "childToType": {
        "Neo Aramaic": "Replace"
      },
      "influences": [
        "Arabic",
        "Mandaic"
      ],
      "alphabet": "𐡀𐡉𐡌𐡓𐡀",
      "description": "The 3rd century AD is taken as the threshold between Old and Middle Aramaic. During that century, the nature of the various Aramaic languages and dialects began to change. The descendants of Imperial Aramaic ceased to be living languages, and the eastern and western regional languages began to develop vital new literatures."
    },
    "Maltese": {
      "name": "Maltese",
      "phonetic": "mɒlˈtiːz",
      "years": "1230 CE - Today",
      "childToType": {},
      "influences": [
        "Arabic"
      ],
      "alphabet": "Malti",
      "description": "Maltese is a Semitic language derived from late medieval Sicilian Arabic with Romance superstrata spoken by the Maltese people. It is the national language of Malta and the only official Semitic and Afro-Asiatic language of the European Union."
    },
    "Himyaritic": {
      "name": "Himyaritic",
      "phonetic": "hɪmjeəɹɪtɪk",
      "years": "135 CE - 960 CE",
      "childToType": {},
      "influences": [
        "Sabaean",
        "Hadramatic"
      ],
      "alphabet": "𐩢𐩣𐩺𐩧",
      "description": "Himyaritic is an unattested or sparsely attested Semitic language that was spoken in ancient Yemen, by the Himyarite tribal confederacy. It was a Semitic language but either did not belong to the Old South Arabian (Sayhadic) languages according to Christian Robin or was, as more widely accepted, not a distinct language from Sabaic. The precise position inside Semitic is unknown because of the limited knowledge of the language if it is indeed a distinct language from Sabaic."
    },
    "Hadramatic": {
      "name": "Hadramatic",
      "phonetic": "hædɹəmætɪk",
      "years": "780 BCE - 630 CE",
      "childToType": {},
      "influences": [
        "Sabaean",
        "Mehri-Soqotri",
        "Himyaritic",
        "Qatabanic",
        "Mehri"
      ],
      "alphabet": "𐩩𐩥𐩣𐩧𐩮𐩢",
      "description": "Ḥaḑramautic or Ḥaḑramitic was the easternmost of the four known languages of the Old South Arabian subgroup of the Semitic languages. It was used in the Kingdom of Hadhramaut and also the area round the Hadhramite capital of Shabwa, in what is now Yemen. The Hadramites also controlled the trade in frankincense through their important trading post of Sumhuram, now Khor Rori in the Dhofar Governorate, Oman."
    },
    "Minaean": {
      "name": "Minaean",
      "phonetic": "mɪnəi:n",
      "years": "1080 BCE - 135 CE",
      "childToType": {},
      "influences": [
        "Central Semitic",
        "Sabaean",
        "Old Arabic"
      ],
      "alphabet": "𐩣𐩲𐩺𐩬𐩺𐩩",
      "description": "The Minaean language was an Old South Arabian or Ṣayhadic language spoken in Yemen in the times of the Old South Arabian civilisation. The main area of its use may be located in the al-Jawf region of North-East Yemen, primarily in the Wādī Madhāb. Most of texts in this language were composed by the Minaeans, but the other civil-temple communities of the Wādī Madhāb also used it as a literary medium."
    },
    "Qatabanic": {
      "name": "Qatabanic",
      "phonetic": "keɪtəbænɪk",
      "years": "540 BCE - 200 CE",
      "childToType": {},
      "influences": [
        "Sabaean",
        "Hadramatic"
      ],
      "alphabet": "𐩤𐩩𐩨𐩬",
      "description": "Qatabānian (or Qatabānic), one of the four better-documented languages of the Old South Arabian (or \"Ṣayhadic\") sub-group of South Semitic, was spoken mainly but not exclusively in the kingdom of Qatabān, located in central Yemen. Qatabanian inscriptions increase after the beginning of the 4th century BC when the Sabaeans ceased to dominate the area, and Qatabān became an independent kingdom.\n\nAt the end of the 2nd century AD, Saba' and Ḥaḑramawt finally defeated Qatabān, and the inscriptions ended."
    },
    "Ge'ez": {
      "name": "Ge'ez",
      "phonetic": "ˈɡiːɛz",
      "years": "330 BCE - 1230 CE",
      "childToType": {
        "Tigrinya": "Replace"
      },
      "influences": [
        "Amharic"
      ],
      "alphabet": "ግዕዝ",
      "description": "Geʽez (sometimes referred to in scholarly literature as Classical Ethiopic) is an ancient Ethiopian Semitic language. The language originates from what is now northern Ethiopia and Eritrea.\n\nToday, Geʽez is used as the main liturgical language of the Ethiopian Orthodox Tewahedo Church and Eritrean Orthodox Tewahedo Church, the Ethiopian Catholic Church and Eritrean Catholic Church, and the Beta Israel Jewish community."
    },
    "Amharic": {
      "name": "Amharic",
      "phonetic": "æmˈhærɪk",
      "years": "330 BCE - Today",
      "childToType": {},
      "influences": [
        "Ge'ez",
        "Harari-Gurage",
        "Tigrinya",
        "Gurage",
        "Harari"
      ],
      "alphabet": "አማርኛ",
      "description": "Amharic is an Ethiopian Semitic language, which is a subgrouping within the Semitic branch of the Afroasiatic languages. It is spoken as a first language by the Amharas, and also serves as a lingua franca for all other populations residing in major cities and towns of Ethiopia."
    },
    "Harari": {
      "name": "Harari",
      "phonetic": "hæɹəɹɪ",
      "years": "330 BCE - Today",
      "childToType": {},
      "influences": [
        "Amharic",
        "Arabic",
        "Gurage"
      ],
      "alphabet": "ሃራሪ",
      "description": "Harari is an Ethiopian Semitic language spoken by the Harari people of Ethiopia. According to the 2007 Ethiopian census, it is spoken by 25,810 people. Most of its speakers are multilingual in Amharic and/or Eastern Oromo.\n\nHarari was originally written with a version of the Arabic script, then the Ethiopic script was adopted to write the language. Some Harari speakers in diaspora write their language with the Latin alphabet."
    },
    "Gurage": {
      "name": "Gurage",
      "phonetic": "ɡʊəˈrɑːɡeɪ",
      "years": "330 BCE - Today",
      "childToType": {},
      "influences": [
        "Amharic",
        "Harari"
      ],
      "alphabet": "ጉራጌ",
      "description": "The Gurage languages, also known as Guragie, is a dialect-continuum language, which belong to the Semitic branch of the Afroasiatic language family. They are spoken by the Gurage people, who inhabit the Gurage Zone within the larger multi-ethnic Southern Nations, Nationalities, and Peoples' Region in central Ethiopia."
    },
    "Mandaic": {
      "name": "Mandaic",
      "phonetic": "mændeɪɪk",
      "years": "450 CE - Today",
      "childToType": {},
      "influences": [
        "Arabic",
        "Middle Aramaic",
        "Neo Aramaic"
      ],
      "alphabet": "ࢲࡠࢃ࢜ࡠ",
      "description": "Mandaic is a southeastern Aramaic variety in use by the Mandaean community, traditionally based in southern parts of Iraq and southwest Iran, for their religious books. Classical Mandaic is still employed by Mandaean priests in liturgical rites. The modern descendant of Classical Mandaic, known as Neo-Mandaic or Modern Mandaic, is spoken by a small section of Mandaeans around Ahvaz and Khorramshahr in the southern Iranian Khuzestan province."
    }
  },
  {
    "Neo Aramaic": {
      "name": "Neo Aramaic",
      "phonetic": "nɪəʊ æɹəmeɪɪk",
      "years": "1230 CE - Today",
      "childToType": {
        "Modern Hebrew": "Add"
      },
      "influences": [
        "Arabic",
        "Mandaic",
        "Modern Hebrew"
      ],
      "alphabet": "אַרָמִית לׅשָנַא\nܐܪܡܝܐ\nܟܠܕܝܐ\nࠀࠓࠌࠉࠕ\n",
      "description": "The Neo-Aramaic or Modern Aramaic languages are varieties of Aramaic that evolved during the late medieval and early modern periods, and continue to the present day as vernacular (spoken) languages of modern Aramaic-speaking communities."
    },
    "Mishnaic Hebrew": {
      "name": "Mishnaic Hebrew",
      "phonetic": "mɪʃneɪɪk hi:bɹu:",
      "years": "135 CE - 450 CE",
      "childToType": {
        "Modern Hebrew": "Revive"
      },
      "influences": [
        "Old Arabic",
        "Old Aramaic"
      ],
      "alphabet": "לשון חז\"ל",
      "description": "Mishnaic Hebrew is the Hebrew of Talmudic texts. Mishnaic Hebrew can be sub-divided into Mishnaic Hebrew proper, which was a spoken language, and Amoraic Hebrew, which was a literary language only."
    },
    "Tigrinya": {
      "name": "Tigrinya",
      "phonetic": "təˈɡrinyə",
      "years": "1230 CE - Today",
      "childToType": {
        "Tigre": "Add"
      },
      "influences": [
        "Tigre",
        "Arabic"
      ],
      "alphabet": "ትግርኛ",
      "description": "Tigrinya is an Ethio-Semitic language commonly spoken in Eritrea and in northern Ethiopia's Tigray Region by the Tigrinya and Tigrayan peoples. It is also spoken by the global diaspora of these regions."
    }
  },
  {
    "Modern Hebrew": {
      "name": "Modern Hebrew",
      "phonetic": "mɒdn hi:bɹu:",
      "years": "1910 CE - Today",
      "childToType": {},
      "influences": [
        "Arabic",
        "Neo Aramaic",
        "Yiddish"
      ],
      "alphabet": "עברית חדשה",
      "description": "Modern Hebrew, is the standard form of the Hebrew language spoken today. Spoken in ancient times, Ancient Hebrew, a member of the Canaanite branch of the Semitic language family, was supplanted as the Jewish vernacular by the western dialect of Aramaic beginning in the third century BCE, though it continued to be used as a liturgical and literary language. It was revived as a spoken language in the 19th and 20th centuries and is the official language of Israel.\n\nOf the Canaanite languages, Modern Hebrew is the only language spoken today."
    },
    "Tigre": {
      "name": "Tigre",
      "phonetic": "tiɡˈɾe",
      "years": "1800 CE - Today",
      "childToType": {},
      "influences": [
        "Tigrinya",
        "Arabic"
      ],
      "alphabet": "ትግራይት",
      "description": "Tigre, better known in Eritrea by its autonym Tigrayit, is an Eritrean Semitic language spoken in the Horn of Africa. It belongs to the Semitic branch and is primarily spoken by the Tigre people in Eritrea."
    }
  }
]